<a href="https://colab.research.google.com/github/Luan-Weba-Soares/lia1-2023-1/blob/main/entregas/Entrega_9_Aula_16_inserindo_tabelas_no_banco.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install -q psycopg2

In [ ]:
import pandas as pd
# Importa a biblioteca de conexão à base de dados
import psycopg2 as pg
from sqlalchemy import create_engine

In [ ]:
import psycopg2
conn = psycopg2.connect(
    host="localhost",
    port=5432,
    user="postgres",
    password="root",
    database="aula16"
)

cursor = conn.cursor()

In [ ]:
cursor = conn.cursor()

drop_table_venda = """
DROP TABLE IF EXISTS Venda;
"""
cursor.execute(drop_table_venda)


drop_table_cliente = """
DROP TABLE IF EXISTS Cliente;
"""
cursor.execute(drop_table_cliente)

drop_table_livro = """
DROP TABLE IF EXISTS Livro;
"""
cursor.execute(drop_table_livro)

In [ ]:
create_table_cliente = """
CREATE TABLE Cliente
(
 cli_id SERIAL PRIMARY KEY,
 cli_nome VARCHAR,
 cli_endereco VARCHAR
);
"""
cursor.execute(create_table_cliente)

In [ ]:
# Crie a tabela livro
create_table_livro = """
CREATE TABLE livro
(
 liv_id SERIAL PRIMARY KEY,
 liv_titulo VARCHAR,
 liv_isbn VARCHAR
);
"""
cursor.execute(create_table_livro)

In [ ]:
# Crie a tabela Venda
create_table_venda = """
CREATE TABLE Venda
(
 ven_id SERIAL PRIMARY KEY,
 ven_fret FLOAT,
 ven_valor FLOAT,
 cli_id INT,
 liv_id INT,
 FOREIGN KEY(cli_id) REFERENCES Cliente (cli_id),
 FOREIGN KEY(liv_id) REFERENCES Livro (liv_id)
);
"""
cursor.execute(create_table_venda)

In [ ]:
conn.commit()
cursor.close()
conn.close()

In [ ]:
engine = create_engine('postgresql://postgres:root@localhost/aula16')
query = "SELECT * FROM cliente"
df = pd.read_sql_query(query, engine)
df

Empty DataFrame
Columns: [cli_id, cli_nome, cli_endereco]
Index: []

### Inserindo valores

In [ ]:
import psycopg2
conn = psycopg2.connect(
    host="localhost",
    port=5432,
    user="postgres",
    password="root",
    database="aula16"
)

cursor = conn.cursor()

In [ ]:
insert_cliente = """
INSERT INTO Cliente (cli_nome, cli_endereco)
VALUES (%s, %s);
"""
values_cliente = [("Luan", "Rua D"), ("Vinicius", "Rua K"), ("Heinrych", "Rua A")]
cursor.executemany(insert_cliente, values_cliente)
conn.commit()

In [ ]:
new_name = input("Digite o nome da pessoa: ")
cli_endereco = input("Digite o endereço: ")
cursor.execute(f"insert into cliente (cli_nome, cli_endereco) values {new_name,cli_endereco}")
conn.commit()

cursor.execute('select * from cliente')
print(cursor.fetchall())

Digite o nome da pessoa: Fernando
Digite o endereço: Rua M
[(1, 'Luan', 'Rua D'), (2, 'Vinicius', 'Rua K'), (3, 'Heinrych', 'Rua A'), (4, 'Fernando', 'Rua M')]

In [ ]:
insert_livro = """
INSERT INTO livro (liv_titulo, liv_isbn)
VALUES (%s, %s);
"""
values_livro = ("Livro 1", "ISBN 123")
cursor.execute(insert_livro, values_livro)
conn.commit()

In [ ]:
new_livro = input("Digite o nome do livro: ")
new_isbn = input("Digite o isbn: ")
cursor.execute(f"insert into livro (liv_titulo, liv_isbn) values {new_livro, new_isbn}")
conn.commit()

cursor.execute('select * from livro')
print(cursor.fetchall())

Digite o nome do livro: MT
Digite o isbn: 321
[(1, 'Livro 1', 'ISBN 123'), (2, 'MT', '321')]

In [ ]:
engine = create_engine('postgresql://postgres:root@localhost/aula16')
query = "SELECT * FROM livro"
df = pd.read_sql_query(query, engine)
df

   liv_id liv_titulo  liv_isbn
0       1    Livro 1  ISBN 123
1       2         MT       321

In [ ]:
ven_fret = input("Digite o valor do frete: ")
ven_valor = input("Digite o valor do livro: ")
cli_id = input("Digite o id do cliente: ")
liv_id = input("Digit o id do livro: ")
cursor.execute("insert into venda (ven_fret, ven_valor, cli_id, liv_id) values"+
               f" {ven_fret, ven_valor,cli_id,liv_id} ")
conn.commit()

cursor.execute('select * from venda')
print(cursor.fetchall())

Digite o valor do frete: 20
Digite o valor do livro: 40
Digite o id do cliente: 1
Digit o id do livro: 2
[(1, 20.0, 40.0, 1, 2)]

In [ ]:
conn.commit()
cursor.close()
conn.close()

In [ ]:
engine = create_engine('postgresql://postgres:root@localhost/aula16')
query = "SELECT * FROM venda"
df = pd.read_sql_query(query, engine)
df

   ven_id  ven_fret  ven_valor  cli_id  liv_id
0       1      20.0       40.0       1       2